app/controllers/accounts_controller.rb

    def index
        @contas = Account.order :id
---
SELECT "accounts".* FROM "accounts" ORDER BY "accounts"."id" ASC

    def create
        valores = params.require(:account).permit!
        Account.create valores
---
INSERT INTO "accounts" ("name", "user_id", "created_at", "updated_at", "balance") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Itau"], ["user_id", 1], ["created_at", 2016-12-02 00:14:22 UTC], ["updated_at", 2016-12-02 00:14:22 UTC], ["balance", #<BigDecimal:7fbd1c803ac8,'0.1E4',9(18)>]]

    def destroy
        Account.destroy params[:id]
---
DELETE FROM "accounts" WHERE "accounts"."id" = $1  [["id", 1]]