app/controllers/accounts_controller.rb

    def index
        @contas = Account.where({user_id: session[:user_id]}).order :id
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 ORDER BY "accounts"."id" ASC  [["user_id", 1]]