app/controllers/categories_controller.rb

    def create
        categoryParameters = params[:category]
        @category = Category.new
        @category.description = categoryParameters[:description]
        @category.user_id = session[:user_id]

        if categoryParameters[:description].empty?
            flash[:notice] = "O campo Descrição deve ser preenchido."
            redirect_to :new_category
        else
            flash[:notice] = @category.save[1]
---
INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Alimentação"], ["created_at", 2016-10-06 00:02:23 UTC], ["updated_at", 2016-10-06 00:02:23 UTC]]