app/controllers/login_controller.rb

    def login
        @user           = User.new
        @user.email     = params[:email]
        @user.password  = params[:password]

        if @user.email.empty?
---
SELECT "users".* FROM "users"