app/controllers/login_controller.rb

INSERT INTO "logins" ("success", "users_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["success", true], ["users_id", 1], ["created_at", 2016-10-04 14:38:10 UTC], ["updated_at", 2016-10-04 14:38:10 UTC]]
---
  def login
    @email = params[:email]
    @passwd = params[:passwd]

    if !@email.present? or !@passwd.present?
      flash[:alert] = "Credenciais inválidas."
      redirect_to action: index
      return
    end
    query = <<-SQL
        SELECT (PASSWORD = CRYPT(%s, PASSWORD)) AS MATCH, ID FROM USERS WHERE
        EMAIL = %s
    SQL

    @success = false
    result = User.find_by_sql(query % [User.connection.quote(@passwd), User.connection.quote(@email)])
    unless result.empty?
      result.each do |r|
        if r.id && (!r.match)
          flash[:alert] = "Combinação de e-mail e senha inválida."
        elsif r.id && r.match
          if register_session(id=r.id)
            @success = true
          else
            flash[:alert] = "Erro ao registrar sessão"
          end
        end
        login_params = { users_id: r.id, success: @success}
        Login.new(login_params).save

UPDATE "users" SET "locked" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["locked", true], ["updated_at", 2016-10-04 15:27:41 UTC], ["id", 1]]
---
  def set_password
    @success = false
    @passwd_len = 7
    if params[:password].present? and params[:password2].present? and params[:token].present?
      passwd = params[:password]
      passwd_conf = params[:password2]
      token = params[:token]
      if passwd == passwd_conf && passwd.length >= @passwd_len
        @recover = RecoverPassword.find_by token: token
        if @recover.present?
          @success = true
          @user = User.find(@recover.user_id)
          @recover.active = false
          @recover.save