app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
  def index
    @transactions = Transaction.all

INSERT INTO "transactions" ("account_id", "user_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 1], ["user_id", 2], ["amount", 12.0], ["created_at", 2016-12-04 21:58:35 UTC], ["updated_at", 2016-12-04 21:58:35 UTC]]
---
  def create
    @transaction = Transaction.new(transaction_params)

    respond_to do |format|
      if @transaction.save

UPDATE "transactions" SET "user_id" = $1, "category_id" = $2, "updated_at" = $3 WHERE "transactions"."id" = $4  [["user_id", 5], ["category_id", 3], ["updated_at", 2016-10-06 00:30:19 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @transaction.update(transaction_params)

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_transaction
      @transaction = Transaction.find(params[:id])