app/controllers/transactions_controller.rb

SELECT "accounts".* FROM "accounts" ORDER BY "accounts"."name" ASC
---
  def new
    @acc_list = Account.all.order(:name).collect{|p| [p.name, p.id]}