app/controllers/transactions_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", #<BigDecimal:b0240d0,'0.12E2',9(18)>], ["updated_at", 2016-12-06 03:30:20 UTC], ["id", 1]]
---
  def create
    @transaction = Transaction.new(transaction_params)
    if @transaction.save
      account = Account.find(@transaction.account_id)
      account.balance += @transaction.amount
      account.save