app/views/transactions/new.html.erb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 ORDER BY "accounts"."name" ASC  [["user_id", 1]]
---
  <%= t.label "Conta: " %>
  <%= t.select :account_id, Account.where(user_id: session[:user_id]).order(:name).collect{|p| [p.name, p.id]}, include_blank: true %>

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 ORDER BY "categories"."description" ASC  [["user_id", 1]]
---
  <%= t.label "Categoria: " %>
  <%= t.select :category_id, Category.where(user_id: session[:user_id]).order(:description).collect{|p| [p.description, p.id]}, include_blank: true %>