app/views/transactions/new.html.erb

SELECT "accounts".* FROM "accounts" ORDER BY "accounts"."name" ASC
---
  <%= t.label "Conta: " %>
  <%= t.select :account_id, Account.all.order(:name).collect{|p| [p.name, p.id]}, include_blank: true %>